pyocd/pyOCD/pyocd/debug/svd/data/MKE17Z7.xml
        <register>
          <name>SYNCONF</name>
          <description>Synchronization Configuration</description>
          <addressOffset>0x8C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HWTRIGMODE</name>
              <description>Hardware Trigger Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HWTRIGMODE_clears_yes</name>
                  <description>FTM clears the TRIGj bit when the hardware trigger j is detected, where j = 0, 1,2.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTRIGMODE_clears_no</name>
                  <description>FTM does not clear the TRIGj bit when the hardware trigger j is detected, where j = 0, 1,2.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CNTINC</name>
              <description>CNTIN Register Synchronization</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CNTINC_input</name>
                  <description>CNTIN register is updated with its buffer value at all rising edges of FTM input clock.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNTINC_pwm</name>
                  <description>CNTIN register is updated with its buffer value by the PWM synchronization.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INVC</name>
              <description>INVCTRL Register Synchronization</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVC_input</name>
                  <description>INVCTRL register is updated with its buffer value at all rising edges of FTM input clock.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVC_pwm</name>
                  <description>INVCTRL register is updated with its buffer value by the PWM synchronization.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWOC</name>
              <description>SWOCTRL Register Synchronization</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWOC_input</name>
                  <description>SWOCTRL register is updated with its buffer value at all rising edges of FTM input clock.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWOC_pwm</name>
                  <description>SWOCTRL register is updated with its buffer value by the PWM synchronization.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNCMODE</name>
              <description>Synchronization Mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYNCMODE_legacy</name>
                  <description>Legacy PWM synchronization is selected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCMODE_enhanced</name>
                  <description>Enhanced PWM synchronization is selected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWRSTCNT</name>
              <description>FTM counter synchronization is activated by the software trigger</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWRSTCNT_inactive</name>
                  <description>The software trigger does not activate the FTM counter synchronization.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWRSTCNT_active</name>
                  <description>The software trigger activates the FTM counter synchronization.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWWRBUF</name>
              <description>MOD, HCR, CNTIN, and CV registers synchronization is activated by the software trigger</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWWRBUF_inactive</name>
                  <description>The software trigger does not activate MOD, HCR, CNTIN, and CV registers synchronization.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWWRBUF_active</name>
                  <description>The software trigger activates MOD, HCR, CNTIN, and CV registers synchronization.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWOM</name>
              <description>Output mask synchronization is activated by the software trigger</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWOM_inactive</name>
                  <description>The software trigger does not activate the OUTMASK register synchronization.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWOM_active</name>
                  <description>The software trigger activates the OUTMASK register synchronization.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWINVC</name>
              <description>Inverting control synchronization is activated by the software trigger</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWINVC_inactive</name>
                  <description>The software trigger does not activate the INVCTRL register synchronization.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWINVC_active</name>
                  <description>The software trigger activates the INVCTRL register synchronization.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWSOC</name>
              <description>Software output control synchronization is activated by the software trigger</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWSOC_inactive</name>
                  <description>The software trigger does not activate the SWOCTRL register synchronization.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWSOC_active</name>
                  <description>The software trigger activates the SWOCTRL register synchronization.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HWRSTCNT</name>
              <description>FTM counter synchronization is activated by a hardware trigger</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HWRSTCNT_inactive</name>
                  <description>A hardware trigger does not activate the FTM counter synchronization.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWRSTCNT_active</name>
                  <description>A hardware trigger activates the FTM counter synchronization.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HWWRBUF</name>
              <description>MOD, HCR, CNTIN, and CV registers synchronization is activated by a hardware trigger</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HWWRBUF_inactive</name>
                  <description>A hardware trigger does not activate MOD, HCR, CNTIN, and CV registers synchronization.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWWRBUF_active</name>
                  <description>A hardware trigger activates MOD, HCR, CNTIN, and CV registers synchronization.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HWOM</name>
              <description>Output mask synchronization is activated by a hardware trigger</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HWOM_inactive</name>
                  <description>A hardware trigger does not activate the OUTMASK register synchronization.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWOM_active</name>
                  <description>A hardware trigger activates the OUTMASK register synchronization.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HWINVC</name>
              <description>Inverting control synchronization is activated by a hardware trigger</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HWINVC_inactive</name>
                  <description>A hardware trigger does not activate the INVCTRL register synchronization.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWINVC_active</name>
                  <description>A hardware trigger activates the INVCTRL register synchronization.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HWSOC</name>
              <description>Software output control synchronization is activated by a hardware trigger</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HWSOC_inactive</name>
                  <description>A hardware trigger does not activate the SWOCTRL register synchronization.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWSOC_active</name>
                  <description>A hardware trigger activates the SWOCTRL register synchronization.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INVCTRL</name>
          <description>FTM Inverting Control</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INV0EN</name>
              <description>Pair Channels 0 Inverting Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INV0EN_disabled</name>
                  <description>Inverting is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV0EN_enabled</name>
                  <description>Inverting is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INV1EN</name>
              <description>Pair Channels 1 Inverting Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INV1EN_disabled</name>
                  <description>Inverting is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV1EN_enabled</name>
                  <description>Inverting is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INV2EN</name>
              <description>Pair Channels 2 Inverting Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INV2EN_disabled</name>
                  <description>Inverting is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV2EN_enabled</name>
                  <description>Inverting is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INV3EN</name>
              <description>Pair Channels 3 Inverting Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INV2EN_disabled</name>
                  <description>Inverting is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV2EN_enabled</name>
                  <description>Inverting is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
