pyocd/pyOCD/pyocd/debug/svd/data/MKE17Z7.xml
        <register>
          <name>COMBINE</name>
          <description>Function For Linked Channels</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>COMBINE0</name>
              <description>Combine Channels For n = 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP0</name>
              <description>Complement Of Channel (n) For n = 0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMP0_same_modcomb</name>
                  <description>If the channels (n) and (n+1) are in Combine Mode or Modified Combine PWM Mode, the channel (n+1) output is the same as the channel (n) output. If the channel (n+1) is in Output Compare Mode, EPWM or CPWM, the channel (n+1) output is independent from channel (n) output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP0_complement</name>
                  <description>The channel (n+1) output is the complement of the channel (n) output.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DECAPEN0</name>
              <description>Dual Edge Capture Mode Enable For n = 0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DECAP0</name>
              <description>Dual Edge Capture Mode Captures For n = 0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DECAP0_inactive</name>
                  <description>The dual edge captures are inactive.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DECAP0_active</name>
                  <description>The dual edge captures are active.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DTEN0</name>
              <description>Deadtime Enable For n = 0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DTEN0_disabled</name>
                  <description>The deadtime insertion in this pair of channels is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTEN0_enabled</name>
                  <description>The deadtime insertion in this pair of channels is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNCEN0</name>
              <description>Synchronization Enable For n = 0</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYNCEN0_disabled</name>
                  <description>The PWM synchronization in this pair of channels is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCEN0_enabled</name>
                  <description>The PWM synchronization in this pair of channels is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCOMBINE0</name>
              <description>Modified Combine Mode For n = 0</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMBINE1</name>
              <description>Combine Channels For n = 2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP1</name>
              <description>Complement Of Channel (n) For n = 2</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMP1_modcomb</name>
                  <description>If the channels (n) and (n+1) are in Combine Mode or Modified Combine PWM Mode, the channel (n+1) output is the same as the channel (n) output. If the channel (n+1) is in Output Compare Mode, EPWM or CPWM, the channel (n+1) output is independent from channel (n) output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP1_complement</name>
                  <description>The channel (n+1) output is the complement of the channel (n) output.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DECAPEN1</name>
              <description>Dual Edge Capture Mode Enable For n = 2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DECAP1</name>
              <description>Dual Edge Capture Mode Captures For n = 2</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DECAP1_inactive</name>
                  <description>The dual edge captures are inactive.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DECAP1_active</name>
                  <description>The dual edge captures are active.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DTEN1</name>
              <description>Deadtime Enable For n = 2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DTEN1_disabled</name>
                  <description>The deadtime insertion in this pair of channels is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTEN1_enabled</name>
                  <description>The deadtime insertion in this pair of channels is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNCEN1</name>
              <description>Synchronization Enable For n = 2</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYNCEN1_disabled</name>
                  <description>The PWM synchronization in this pair of channels is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCEN1_enabled</name>
                  <description>The PWM synchronization in this pair of channels is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCOMBINE1</name>
              <description>Modified Combine Mode For n = 2</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEADTIME</name>
          <description>Deadtime Configuration</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DTVAL</name>
              <description>Deadtime Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTPS</name>
              <description>Deadtime Prescaler Value</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DTPS_divideby1</name>
                  <description>Divide the FTM input clock by 1.</description>
                  <value>#0x</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTPS_divideby4</name>
                  <description>Divide the FTM input clock by 4.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTPS_divideby16</name>
                  <description>Divide the FTM input clock by 16.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTTRIG</name>
          <description>FTM External Trigger</description>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CH2TRIG</name>
              <description>Channel 2 External Trigger Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH2TRIG_disabled</name>
                  <description>The generation of this external trigger is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH2TRIG_enabled</name>
                  <description>The generation of this external trigger is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH3TRIG</name>
              <description>Channel 3 External Trigger Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH3TRIG_disabled</name>
                  <description>The generation of this external trigger is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH3TRIG_enabled</name>
                  <description>The generation of this external trigger is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH0TRIG</name>
              <description>Channel 0 External Trigger Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH0TRIG_disabled</name>
                  <description>The generation of this external trigger is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH0TRIG_enabled</name>
                  <description>The generation of this external trigger is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH1TRIG</name>
              <description>Channel 1 External Trigger Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH1TRIG_disabled</name>
                  <description>The generation of this external trigger is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH1TRIG_enabled</name>
                  <description>The generation of this external trigger is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INITTRIGEN</name>
              <description>Initialization Trigger Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INITTRIGEN_disabled</name>
                  <description>The generation of initialization trigger is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INITTRIGEN_enabled</name>
                  <description>The generation of initialization trigger is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGF</name>
              <description>Channel Trigger Flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIGF_no</name>
                  <description>No channel trigger was generated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGF_yes</name>
                  <description>A channel trigger was generated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>POL</name>
          <description>Channels Polarity</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>POL0</name>
              <description>Channel 0 Polarity</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POL_high</name>
                  <description>The channel polarity is active high.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POL_low</name>
                  <description>The channel polarity is active low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POL1</name>
              <description>Channel 1 Polarity</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POL_high</name>
                  <description>The channel polarity is active high.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POL_low</name>
                  <description>The channel polarity is active low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POL2</name>
              <description>Channel 2 Polarity</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POL_high</name>
                  <description>The channel polarity is active high.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POL_low</name>
                  <description>The channel polarity is active low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POL3</name>
              <description>Channel 3 Polarity</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POL_high</name>
                  <description>The channel polarity is active high.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POL_low</name>
                  <description>The channel polarity is active low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FMS</name>
          <description>Fault Mode Status</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WPEN</name>
              <description>Write Protection Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WPEN_disabled</name>
                  <description>Write protection is disabled. Write protected bits can be written.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WPEN_enabled</name>
                  <description>Write protection is enabled. Write protected bits cannot be written.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FILTER</name>
          <description>Input Capture Filter Control</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CH0FVAL</name>
              <description>Channel 0 Input Filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1FVAL</name>
              <description>Channel 1 Input Filter</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2FVAL</name>
              <description>Channel 2 Input Filter</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3FVAL</name>
              <description>Channel 3 Input Filter</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
