pyocd/pyOCD/pyocd/debug/svd/data/MKE17Z7.xml
        <register>
          <name>PCC_FLEXIOTRIG0</name>
          <description>PCC Register</description>
          <addressOffset>0x188</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xC0000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PCD</name>
              <description>Peripheral Clock Divider Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRAC</name>
              <description>Peripheral Clock Divider Fraction</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRAC_0</name>
                  <description>Fractional value is 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRAC_1</name>
                  <description>Fractional value is 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PCS</name>
              <description>Peripheral Clock Source Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PCS_0</name>
                  <description>Clock is off (or test clock is enabled).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCS_1</name>
                  <description>OSCCLK - System Oscillator Bus Clock(scg_sosc_slow_clk).</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCS_2</name>
                  <description>SCGIRCLK - Slow IRC Clock(scg_sirc_slow_clk), (maximum is 8MHz).</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCS_3</name>
                  <description>SCGFIRCLK - Fast IRC Clock(scg_firc_slow_clk), (maximum is 48MHz).</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCS_6</name>
                  <description>SCGPCLK System PLL clock(scg_spll_slow_clk).</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CGC</name>
              <description>Clock Gate Control</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CGC_0</name>
                  <description>Clock disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CGC_1</name>
                  <description>Clock enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PR</name>
              <description>Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PR_0</name>
                  <description>Peripheral is not present.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PR_1</name>
                  <description>Peripheral is present.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PCC_FLEXIOTRIG1</name>
          <description>PCC Register</description>
          <addressOffset>0x18C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xC0000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PCD</name>
              <description>Peripheral Clock Divider Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRAC</name>
              <description>Peripheral Clock Divider Fraction</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRAC_0</name>
                  <description>Fractional value is 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRAC_1</name>
                  <description>Fractional value is 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PCS</name>
              <description>Peripheral Clock Source Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PCS_0</name>
                  <description>Clock is off (or test clock is enabled).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCS_1</name>
                  <description>OSCCLK - System Oscillator Bus Clock(scg_sosc_slow_clk).</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCS_2</name>
                  <description>SCGIRCLK - Slow IRC Clock(scg_sirc_slow_clk), (maximum is 8MHz).</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCS_3</name>
                  <description>SCGFIRCLK - Fast IRC Clock(scg_firc_slow_clk), (maximum is 48MHz).</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCS_6</name>
                  <description>SCGPCLK System PLL clock(scg_spll_slow_clk).</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CGC</name>
              <description>Clock Gate Control</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CGC_0</name>
                  <description>Clock disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CGC_1</name>
                  <description>Clock enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PR</name>
              <description>Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PR_0</name>
                  <description>Peripheral is not present.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PR_1</name>
                  <description>Peripheral is present.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PCC_LPI2C0</name>
          <description>PCC Register</description>
          <addressOffset>0x198</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PCS</name>
              <description>Peripheral Clock Source Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PCS_0</name>
                  <description>Clock is off (or test clock is enabled).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCS_1</name>
                  <description>OSCCLK - System Oscillator Bus Clock(scg_sosc_slow_clk).</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCS_2</name>
                  <description>SCGIRCLK - Slow IRC Clock(scg_sirc_slow_clk), (maximum is 8MHz).</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCS_3</name>
                  <description>SCGFIRCLK - Fast IRC Clock(scg_firc_slow_clk), (maximum is 48MHz).</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCS_6</name>
                  <description>SCGPCLK System PLL clock(scg_spll_slow_clk).</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CGC</name>
              <description>Clock Gate Control</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CGC_0</name>
                  <description>Clock disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CGC_1</name>
                  <description>Clock enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PR</name>
              <description>Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PR_0</name>
                  <description>Peripheral is not present.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PR_1</name>
                  <description>Peripheral is present.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PCC_LPUART0</name>
          <description>PCC Register</description>
          <addressOffset>0x1A8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PCS</name>
              <description>Peripheral Clock Source Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PCS_0</name>
                  <description>Clock is off (or test clock is enabled).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCS_1</name>
                  <description>OSCCLK - System Oscillator Bus Clock(scg_sosc_slow_clk).</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCS_2</name>
                  <description>SCGIRCLK - Slow IRC Clock(scg_sirc_slow_clk), (maximum is 8MHz).</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCS_3</name>
                  <description>SCGFIRCLK - Fast IRC Clock(scg_firc_slow_clk), (maximum is 48MHz).</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCS_6</name>
                  <description>SCGPCLK System PLL clock(scg_spll_slow_clk).</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CGC</name>
              <description>Clock Gate Control</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CGC_0</name>
                  <description>Clock disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CGC_1</name>
                  <description>Clock enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PR</name>
              <description>Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PR_0</name>
                  <description>Peripheral is not present.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PR_1</name>
                  <description>Peripheral is present.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PCC_LPUART1</name>
          <description>PCC Register</description>
          <addressOffset>0x1AC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PCS</name>
              <description>Peripheral Clock Source Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PCS_0</name>
                  <description>Clock is off (or test clock is enabled).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCS_1</name>
                  <description>OSCCLK - System Oscillator Bus Clock(scg_sosc_slow_clk).</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCS_2</name>
                  <description>SCGIRCLK - Slow IRC Clock(scg_sirc_slow_clk), (maximum is 8MHz).</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCS_3</name>
                  <description>SCGFIRCLK - Fast IRC Clock(scg_firc_slow_clk), (maximum is 48MHz).</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCS_6</name>
                  <description>SCGPCLK System PLL clock(scg_spll_slow_clk).</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CGC</name>
              <description>Clock Gate Control</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CGC_0</name>
                  <description>Clock disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CGC_1</name>
                  <description>Clock enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PR</name>
              <description>Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PR_0</name>
                  <description>Peripheral is not present.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PR_1</name>
                  <description>Peripheral is present.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PCC_LPUART2</name>
          <description>PCC Register</description>
          <addressOffset>0x1B0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PCS</name>
              <description>Peripheral Clock Source Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PCS_0</name>
                  <description>Clock is off (or test clock is enabled).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCS_1</name>
                  <description>OSCCLK - System Oscillator Bus Clock(scg_sosc_slow_clk).</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCS_2</name>
                  <description>SCGIRCLK - Slow IRC Clock(scg_sirc_slow_clk), (maximum is 8MHz).</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCS_3</name>
                  <description>SCGFIRCLK - Fast IRC Clock(scg_firc_slow_clk), (maximum is 48MHz).</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCS_6</name>
                  <description>SCGPCLK System PLL clock(scg_spll_slow_clk).</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CGC</name>
              <description>Clock Gate Control</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CGC_0</name>
                  <description>Clock disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CGC_1</name>
                  <description>Clock enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PR</name>
              <description>Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PR_0</name>
                  <description>Peripheral is not present.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PR_1</name>
                  <description>Peripheral is present.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PCC_CMP0</name>
          <description>PCC Register</description>
          <addressOffset>0x1CC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CGC</name>
              <description>Clock Gate Control</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CGC_0</name>
                  <description>Clock disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CGC_1</name>
                  <description>Clock enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PR</name>
              <description>Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PR_0</name>
                  <description>Peripheral is not present.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PR_1</name>
                  <description>Peripheral is present.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
