pyocd/pyOCD/pyocd/debug/svd/data/MKE17Z7.xml
        <register>
          <name>NVICICPR</name>
          <description>Interrupt Clear Pending Register</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLRPEND0</name>
              <description>DMA channel 0 or 4 transfer complete interrupt clear-pending bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRPEND0_0</name>
                  <description>write: no effect; read: DMA channel 0 or 4 transfer complete interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRPEND0_1</name>
                  <description>write: removes pending state from the DMA channel 0 or 4 transfer complete interrupt; read: DMA channel 0 or 4 transfer complete interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRPEND1</name>
              <description>DMA channel 1 or 5 transfer complete interrupt clear-pending bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRPEND1_0</name>
                  <description>write: no effect; read: DMA channel 1 or 5 transfer complete interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRPEND1_1</name>
                  <description>write: removes pending state from the DMA channel 1 or 5 transfer complete interrupt; read: DMA channel 1 or 5 transfer complete interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRPEND2</name>
              <description>DMA channel 2 or 6 transfer complete interrupt clear-pending bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRPEND2_0</name>
                  <description>write: no effect; read: DMA channel 2 or 6 transfer complete interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRPEND2_1</name>
                  <description>write: removes pending state from the DMA channel 2 or 6 transfer complete interrupt; read: DMA channel 2 or 6 transfer complete interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRPEND3</name>
              <description>DMA channel 3 or 7 transfer complete interrupt clear-pending bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRPEND3_0</name>
                  <description>write: no effect; read: DMA channel 3 or 7 transfer complete interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRPEND3_1</name>
                  <description>write: removes pending state from the DMA channel 3 or 7 transfer complete interrupt; read: DMA channel 3 or 7 transfer complete interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRPEND4</name>
              <description>DMA error interrupt channels 0-7 interrupt clear-pending bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRPEND4_0</name>
                  <description>write: no effect; read: DMA error interrupt channels 0-7 interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRPEND4_1</name>
                  <description>write: removes pending state from the DMA error interrupt channels 0-7 interrupt; read: DMA error interrupt channels 0-7 interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRPEND5</name>
              <description>Single interrupt vector all sources interrupt clear-pending bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRPEND5_0</name>
                  <description>write: no effect; read: Single interrupt vector all sources interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRPEND5_1</name>
                  <description>write: removes pending state from the Single interrupt vector all sources interrupt; read: Single interrupt vector all sources interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRPEND6</name>
              <description>Low-voltage detect, low-voltage warning interrupt clear-pending bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRPEND6_0</name>
                  <description>write: no effect; read: Low-voltage detect, low-voltage warning interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRPEND6_1</name>
                  <description>write: removes pending state from the Low-voltage detect, low-voltage warning interrupt; read: Low-voltage detect, low-voltage warning interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRPEND7</name>
              <description>interrupt clear-pending bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRPEND7_0</name>
                  <description>write: no effect; read: interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRPEND7_1</name>
                  <description>write: removes pending state from the interrupt; read: interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRPEND8</name>
              <description>interrupt clear-pending bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRPEND8_0</name>
                  <description>write: no effect; read: interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRPEND8_1</name>
                  <description>write: removes pending state from the interrupt; read: interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRPEND9</name>
              <description>Reserved iv 25 interrupt clear-pending bit</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRPEND9_0</name>
                  <description>write: no effect; read: Reserved iv 25 interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRPEND9_1</name>
                  <description>write: removes pending state from the Reserved iv 25 interrupt; read: Reserved iv 25 interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRPEND10</name>
              <description>interrupt clear-pending bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRPEND10_0</name>
                  <description>write: no effect; read: interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRPEND10_1</name>
                  <description>write: removes pending state from the interrupt; read: interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRPEND11</name>
              <description>Reserved iv 27 interrupt clear-pending bit</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRPEND11_0</name>
                  <description>write: no effect; read: Reserved iv 27 interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRPEND11_1</name>
                  <description>write: removes pending state from the Reserved iv 27 interrupt; read: Reserved iv 27 interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRPEND12</name>
              <description>interrupt clear-pending bit</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRPEND12_0</name>
                  <description>write: no effect; read: interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRPEND12_1</name>
                  <description>write: removes pending state from the interrupt; read: interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRPEND13</name>
              <description>interrupt clear-pending bit</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRPEND13_0</name>
                  <description>write: no effect; read: interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRPEND13_1</name>
                  <description>write: removes pending state from the interrupt; read: interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRPEND14</name>
              <description>interrupt clear-pending bit</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRPEND14_0</name>
                  <description>write: no effect; read: interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRPEND14_1</name>
                  <description>write: removes pending state from the interrupt; read: interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRPEND15</name>
              <description>Analog-to-Digital Converter 0 interrupt clear-pending bit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRPEND15_0</name>
                  <description>write: no effect; read: Analog-to-Digital Converter 0 interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRPEND15_1</name>
                  <description>write: removes pending state from the Analog-to-Digital Converter 0 interrupt; read: Analog-to-Digital Converter 0 interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRPEND16</name>
              <description>Analog comparator 0 interrupt interrupt clear-pending bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRPEND16_0</name>
                  <description>write: no effect; read: Analog comparator 0 interrupt interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRPEND16_1</name>
                  <description>write: removes pending state from the Analog comparator 0 interrupt interrupt; read: Analog comparator 0 interrupt interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRPEND17</name>
              <description>FlexTimer Module 0 interrupt clear-pending bit</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRPEND17_0</name>
                  <description>write: no effect; read: FlexTimer Module 0 interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRPEND17_1</name>
                  <description>write: removes pending state from the FlexTimer Module 0 interrupt; read: FlexTimer Module 0 interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRPEND18</name>
              <description>FlexTimer Module 1 interrupt clear-pending bit</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRPEND18_0</name>
                  <description>write: no effect; read: FlexTimer Module 1 interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRPEND18_1</name>
                  <description>write: removes pending state from the FlexTimer Module 1 interrupt; read: FlexTimer Module 1 interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRPEND19</name>
              <description>FlexTimer Module 2 interrupt clear-pending bit</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRPEND19_0</name>
                  <description>write: no effect; read: FlexTimer Module 2 interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRPEND19_1</name>
                  <description>write: removes pending state from the FlexTimer Module 2 interrupt; read: FlexTimer Module 2 interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRPEND20</name>
              <description>Reserved iv 36 interrupt clear-pending bit</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRPEND20_0</name>
                  <description>write: no effect; read: Reserved iv 36 interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRPEND20_1</name>
                  <description>write: removes pending state from the Reserved iv 36 interrupt; read: Reserved iv 36 interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRPEND21</name>
              <description>Reserved iv 37 interrupt clear-pending bit</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRPEND21_0</name>
                  <description>write: no effect; read: Reserved iv 37 interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRPEND21_1</name>
                  <description>write: removes pending state from the Reserved iv 37 interrupt; read: Reserved iv 37 interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRPEND22</name>
              <description>Periodic timer overflow interrupt clear-pending bit</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRPEND22_0</name>
                  <description>write: no effect; read: Periodic timer overflow interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRPEND22_1</name>
                  <description>write: removes pending state from the Periodic timer overflow interrupt; read: Periodic timer overflow interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRPEND23</name>
              <description>interrupt clear-pending bit</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRPEND23_0</name>
                  <description>write: no effect; read: interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRPEND23_1</name>
                  <description>write: removes pending state from the interrupt; read: interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
